print ( 'Вы любите тортики? ')
ask = input ()
if ask == "да" :
    print ( "Это превосходно! Я тоже их люблю! А какой вкус вам больше всего нравится?" )
    ask = input ()
    if ask == "ванильный" or ask == "ваниль" :
        print ( "Здорово! Я обожаю ваниль! Могу предложить тебе много ванильных сладостей! Если хочешь посмотреть их все, то заходи на наш сайт!" )
    elif ask == "ягодный" :
        print ( "А с какой именно ягодой ты больше всего любишь торты?" )
        ask == input ()
        if ask == "клубничный" or ask == "клубника" :
            print ( "У нас как раз новая партия! Можешь заказать их прямо сейчас!" )
        elif ask == 'малиновый' or ask == "малиновый" :
            print ( 'Для таких сладкоежек у нас есть целый раздел с малиновыми тортами!' )
        else :
            print ( "Мне очень жаль, но такого у нас нет. Вы можете просмотреть весь наш каталог, может быть что-то вам приглянётся =)" )
    elif ask == "шоколадный" or ask == "шоколад" :
        print ( "В данный момент всё раскупили, но можем предложить шоколадный пуддинг или же пирожное! Посмотрите весь каталог на нашем сайте! " )
    else :
        print ( "Наши работники негодяи и, кажется, не сделали ничего, что имело бы такой же вкус. Нам очень жаль, но вы можете оставить ваш отзыв на нашем сайте, мы обязательно прислушаемся и исправимся!" )
elif ask == "нет" or ask == "не знаю" :
    print ( "Видимо мы ошиблись, думая, что таких, как вы, несуществует. Возможно вы бы хотели просмотреть что-то из кексов и пирожных?" )
    ask == input ()
    if ask == "пирожные" :
        print ( "Уф... А мы уж подумали, что вы не из рядов сладкоежек =) У нас есть много разных вкусов! Предлагаю посмотреть вам наш сайт и выбрать ваш самый любимый!" )
    elif ask == "кексы" :
        print ( "Это просто превосходно! На данный момент у нас остались только ванильные и шоколадные! Хотите заказать?" )
        ask = input ()
        if ask == "да" :
            print ( "Заходите на наш сайт, может быть вам приглянётся ещё что-то!" )
        else :
            print ( "Простите, что не смогли вам угодить! Постараемся стать лучше )" )
    else :
        print ( "Грустно( Что же, надеюсь, что ещё мы ещё увидим вас и сможем подарить сладкую жизнь!" )
elif ask == "возможно" :
    print ( "Неопределённость - тоже хорошо! Мы можем предложит множество разных вкусов и дессертов. Соберитесь семьёй, зайдите на наш сайт и закажите то, что придёт вм по вкусу. Думаю, что каждый найдёт для себя что-то, что доставит ему удовольствие!" )
else :
    print ( "Всего доброго) Будем надеяться, что вам захочется поесть у нас вновь! Ждём в любое время каждый день, кроме вторника! Не забудте про скидки каждую пятницу на карамельки!" )

        
        
    

    
         
