print ("Пожалуйста, введите действие, которое вы хотите выполнить."
       " Я могу производить: сложение (+), вычитание (-), умножение (*),"
       " деление (/) и вычленять корни."
       " Чтобы прекратить работу со мной, введите слово 'стоп'")
act = input ()
if act == "+" or act == "сложение" :
    while 1:
        print ("Вы выбрали действие 'сложение'")
        print ("Введите первое число")
        a = int (input ())
        print ("Введите второе число")
        b = int (input ())
        print ("a + b =" , a + b)
        act = input ()
        if act == "стоп":
            print ("Всего доброго)")
            break
        
elif act == "-" or act == "вычитание" :
    while 1:
        print ("Вы выбрали действие 'вычитание'")
        print ("Введите первое число, из которого будет производиться вычитание")
        a = int (input ())
        print ("Введите второе число, которое будут вычитать")
        b = int (input ())
        print ("a - b =" , a - b)
        act = input ()
        if act == "стоп":
            print ("Всего доброго)")
            break
               
elif act == "*" or act == "умножение" :
    while 1:
        print ("Вы выбрали действие 'умножение'")
        print ("Введите первый множитель")
        act = int (input ())
        print ("Введите второй множитель")
        b = int (input ())
        print ("a * b =" , a * b)
        act = input ()
        if act == "стоп":
            print ("Всего доброго)")
            break
        
elif act == "/" or act == "деление" :
    while 1:
        print ("Вы выбрали действие 'деление'")
        print ("Введите делимое")
        a = int (input ())
        print ("Введите делитель")
        b = int (input ())
        print ("a / b =" , a / b)
        act = input ()
        if act == "стоп":
            print ("Всего доброго)")
            break
        
elif act == "корень" :
    while 1:
        print ("Вы выбрали действие 'корень'")
        print ("Введите число, из которого я должен вычислить корень")
        a = int (input ())
        print ("корень из a =" , a ** (1/2))
        act = input ()
        if act == "стоп":
            print ("Всего доброго)")
            break
        
elif act == "стоп" :
    print ("Всего доброго)")
    
    
